# More SELECT æ–‡ ğŸ³

ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ SELECT æ–‡ã«ãŠã‘ã‚‹ã‚µãƒ–ã‚¯ã‚¨ãƒªãƒ»JOINãƒ»UNIONã®ä½¿ã„æ–¹ã‚’ç¢ºèªã—ã¾ã™ã€‚

## 1. åˆæœŸè¨­å®š

Jupyter Notebook ã‚’å†èµ·å‹•ã—ãŸå ´åˆãªã©ã¯ã“ã“ã‹ã‚‰å®Ÿè¡Œã—ã¦ãã ã•ã„ã€‚

In [ ]:
! pip install ipython-sql pymysql
%load_ext sql

## 2. æ¥ç¶šç¢ºèª

In [2]:
%%sql mysql+pymysql://hello:world@10.0.1.100/employees
select 'hello' as world

1 rows affected.

[('hello',)]

## 3. ã‚µãƒ–ã‚¯ã‚¨ãƒª

ã‚µãƒ–ã‚¯ã‚¨ãƒªã¯ã‚¯ã‚¨ãƒªä¸­ã«è¨˜è¿°ã•ã‚ŒãŸ SELECT æ–‡ã®ã“ã¨ã§ã™ã€‚ã‚µãƒ–ã‚¯ã‚¨ãƒªã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§é›†åˆçš„ãªæ“ä½œã‚’ç°¡å˜ã«è¨˜è¿°ã™ã‚‹ã“ã¨ãŒã§ãã€é›†è¨ˆå‡¦ç†ã‚’è¡Œã†åˆ†æã‚¯ã‚¨ãƒªã‚„åˆ†æ•£å‡¦ç†åŸºç›¤ã‚’ä½¿ã£ãŸå¤§è¦æ¨¡ãƒ‡ãƒ¼ã‚¿ã®æ•´å½¢ã‚’è¡Œã†éš›ã«é‡å®ã—ã¾ã™ã€‚

In [3]:
%%sql
select
    *
from
    (select
        emp_no,
        first_name
    from
        employees
    ) as t
limit 3

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[(10001, 'Georgi'), (10002, 'Bezalel'), (10003, 'Parto')]

FROM å¥ä»¥å¤–ã®éƒ¨åˆ†ã§ã‚‚ã‚µãƒ–ã‚¯ã‚¨ãƒªã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚ä»¥ä¸‹ã¯ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã‹ã‚‰çµ¦æ–™ãŒå¹³å‡ã‚’ä¸‹å›ã£ã¦ã„ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’10ä»¶æŠ½å‡ºã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [4]:
%%sql
select
    *
from
    salaries
where
    salary < (select avg(salary) from salaries)
limit 10

 * mysql+pymysql://hello:***@10.0.1.100/employees
10 rows affected.

[(10001, 60117, datetime.date(1986, 6, 26), datetime.date(1987, 6, 26)),
 (10001, 62102, datetime.date(1987, 6, 26), datetime.date(1988, 6, 25)),
 (10003, 40006, datetime.date(1995, 12, 3), datetime.date(1996, 12, 2)),
 (10003, 43616, datetime.date(1996, 12, 2), datetime.date(1997, 12, 2)),
 (10003, 43466, datetime.date(1997, 12, 2), datetime.date(1998, 12, 2)),
 (10003, 43636, datetime.date(1998, 12, 2), datetime.date(1999, 12, 2)),
 (10003, 43478, datetime.date(1999, 12, 2), datetime.date(2000, 12, 1)),
 (10003, 43699, datetime.date(2000, 12, 1), datetime.date(2001, 12, 1)),
 (10003, 43311, datetime.date(2001, 12, 1), datetime.date(9999, 1, 1)),
 (10004, 40054, datetime.date(1986, 12, 1), datetime.date(1987, 12, 1))]

## 4. EXISTS å¥

WHERE å¥ã®æ¤œç´¢æ¡ä»¶ã« `EXISTS` å¥ã‚’æ¸¡ã™ã¨ã‚µãƒ–ã‚¯ã‚¨ãƒªã®çµæœãŒå­˜åœ¨ã™ã‚‹ã‹ã©ã†ã‹ã§ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’çµã‚Šè¾¼ã‚€ã“ã¨ãŒã§ãã¾ã™ã€‚ã¾ãŸã€ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã«å¯¾å¿œã™ã‚‹ãƒ‡ãƒ¼ã‚¿ã‚’ã‚µãƒ–ã‚¯ã‚¨ãƒªå†…ã§æ¤œç´¢ã™ã‚‹ã‚±ãƒ¼ã‚¹ã®ã‚ˆã†ã«ã€Œã‚µãƒ–ã‚¯ã‚¨ãƒªã®å¤–å´ã€ã«ã‚ã‚‹ãƒ‡ãƒ¼ã‚¿ã«ã‚¢ã‚¯ã‚»ã‚¹ã™ã‚‹ã‚ˆã†ãªã‚µãƒ–ã‚¯ã‚¨ãƒªã‚’ã€Œç›¸é–¢ã‚µãƒ–ã‚¯ã‚¨ãƒªã€ã¨å‘¼ã³ã¾ã™ã€‚ä»¥ä¸‹ã¯ EXISTS å¥ã‚’åˆ©ç”¨ã—ã¦ `title` ãŒ `Technique Leader` ã§ã‚ã‚‹ã‚ˆã†ãªç¤¾å“¡ã‚’æ¤œç´¢ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [5]:
%%sql
select
    *
from
    employees as e
where
    exists
    (select
         emp_no
    from
         titles as t
    where
         e.emp_no = t.emp_no -- ç›¸é–¢ã‚µãƒ–ã‚¯ã‚¨ãƒª
         and title = 'Technique Leader'
    )
limit 5

 * mysql+pymysql://hello:***@10.0.1.100/employees
5 rows affected.

[(10021, datetime.date(1960, 2, 20), 'Ramzi', 'Erde', 'M', datetime.date(1988, 2, 10)),
 (10025, datetime.date(1958, 10, 31), 'Prasadram', 'Heyers', 'M', datetime.date(1987, 8, 17)),
 (10033, datetime.date(1956, 11, 14), 'Arif', 'Merlo', 'M', datetime.date(1987, 3, 18)),
 (10044, datetime.date(1961, 9, 21), 'Mingsen', 'Casley', 'F', datetime.date(1994, 5, 21)),
 (10069, datetime.date(1960, 9, 6), 'Margareta', 'Bierman', 'F', datetime.date(1989, 11, 5))]

## 5. IN å¥ã¨ã‚µãƒ–ã‚¯ã‚¨ãƒª

IN å¥ã‚’ä½¿ã†ã“ã¨ã§è¤‡æ•°æ¡ä»¶ã‹ã‚‰ã„ãšã‚Œã‹ã«ãƒãƒƒãƒã™ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’æ¤œç´¢ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [6]:
%%sql
select
    *
from
    employees
where
    emp_no in (10021, 10022, 10023)

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[(10021, datetime.date(1960, 2, 20), 'Ramzi', 'Erde', 'M', datetime.date(1988, 2, 10)),
 (10022, datetime.date(1952, 7, 8), 'Shahaf', 'Famili', 'M', datetime.date(1995, 8, 22)),
 (10023, datetime.date(1953, 9, 29), 'Bojan', 'Montemayor', 'F', datetime.date(1989, 12, 17))]

IN å¥ã‚‚ã‚µãƒ–ã‚¯ã‚¨ãƒªã¨çµ„ã¿åˆã‚ã›ã‚‹ã“ã¨ãŒã§ãã€å…ˆã»ã© EXISTS å¥ã‚’ä½¿ã£ã¦æ›¸ã„ãŸæ¤œç´¢ã‚¯ã‚¨ãƒªã‚’ä»¥ä¸‹ã®ã‚ˆã†ã«ã—ã¦ IN å¥ã§æ›¸ãæ›ãˆã‚‹ã“ã¨ãŒå¯èƒ½ã§ã™ã€‚

In [7]:
%%sql
select
    *
from
    employees
where
    emp_no in
    (select
        emp_no
    from
        titles
    where
        title = 'Technique Leader'
    )
limit 5

 * mysql+pymysql://hello:***@10.0.1.100/employees
5 rows affected.

[(10021, datetime.date(1960, 2, 20), 'Ramzi', 'Erde', 'M', datetime.date(1988, 2, 10)),
 (10025, datetime.date(1958, 10, 31), 'Prasadram', 'Heyers', 'M', datetime.date(1987, 8, 17)),
 (10033, datetime.date(1956, 11, 14), 'Arif', 'Merlo', 'M', datetime.date(1987, 3, 18)),
 (10044, datetime.date(1961, 9, 21), 'Mingsen', 'Casley', 'F', datetime.date(1994, 5, 21)),
 (10069, datetime.date(1960, 9, 6), 'Margareta', 'Bierman', 'F', datetime.date(1989, 11, 5))]

## 6. å†…éƒ¨çµåˆ

`JOIN` ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§ SELECT æ–‡ã‚’å®Ÿè¡Œã™ã‚‹ã¨ãã«è¤‡æ•°ã®ãƒ†ãƒ¼ãƒ–ãƒ«ã¾ãŸã¯ã‚µãƒ–ã‚¯ã‚¨ãƒªã‚’çµåˆã—ãŸçµæœã‚’å–å¾—ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚çµåˆå½¢å¼ã«ã¯å†…éƒ¨çµåˆï¼ˆ`INNER JOIN`ï¼‰ã¨å¤–éƒ¨çµåˆï¼ˆ`OUTER JOIN`ï¼‰ã¨ã‚¯ãƒ­ã‚¹çµåˆï¼ˆ`CROSS JOIN`ï¼‰ã®3ç¨®é¡ãŒã‚ã‚Šã€ãã‚Œãã‚Œå½¹å‰²ãŒç•°ãªã‚Šã¾ã™ï¼ˆå¤–éƒ¨çµåˆã«ã¤ã„ã¦ã¯ LEFT ã‹ RIGHT ã‹ã¨ã„ã†é•ã„ãŒã‚ã‚Šã¾ã™ï¼‰ã€‚

INNER JOIN ã¨ OUTER JOIN ã®æ§‹æ–‡ã«ã¤ã„ã¦ã¯ä»¥ä¸‹ã®ã‚ˆã†ã«ãªã£ã¦ãŠã‚Šè¤‡æ•°ã®ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ JOIN ã™ã‚‹ã“ã¨ã‚‚ã§ãã¾ã™ã€‚MySQL ã§ `JOIN` ã¨ã ã‘è¨˜è¿°ã—ãŸå ´åˆã¯ `INNER JOIN` ãŒãƒ‡ãƒ•ã‚©ãƒ«ãƒˆã®å‹•ä½œã«ãªã£ã¦ã„ã¾ã™ã€‚

```sql
SELECT
    <å¼>
FROM
    <ãƒ†ãƒ¼ãƒ–ãƒ«>
JOIN
    <çµåˆã™ã‚‹ãƒ†ãƒ¼ãƒ–ãƒ«>
ON
    <çµåˆã™ã‚‹æ¡ä»¶>
JOIN
    <åˆ¥ã®çµåˆã™ã‚‹ãƒ†ãƒ¼ãƒ–ãƒ«>
ON
    <çµåˆã™ã‚‹æ¡ä»¶>
```

`INNER JOIN` ã¯ ID ãªã©ãŒå…±é€šã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’çµåˆã•ã›ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚ä»¥ä¸‹ã¯ `employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ `emp_no` ãŒä¸€è‡´ã™ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’çµåˆã—ã¾ã™ã€‚

In [8]:
%%sql
select
    first_name,
    salary
from
    employees as l
    
inner join
    salaries as r
on l.emp_no = r.emp_no
-- ã“ã“ã¯ using (emp_no) ã¨ã‚‚æ›¸ã‘ã‚‹

where
    to_date = '9999-01-01' -- salaries ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¯éå»ã®çµ¦ä¸æƒ…å ±ã‚‚å…¥ã£ã¦ã„ã‚‹ã®ã§ã“ã®æ¡ä»¶ã§æœ€æ–°ã®çµ¦ä¸ã‚’çµã‚Šè¾¼ã‚€

limit 5

 * mysql+pymysql://hello:***@10.0.1.100/employees
5 rows affected.

[('Georgi', 88958),
 ('Bezalel', 72527),
 ('Parto', 43311),
 ('Chirstian', 74057),
 ('Kyoichi', 94692)]

## 7. å¤–éƒ¨çµåˆ

`INNER JOIN` ã ã¨ç‰‡æ–¹ã®ãƒ†ãƒ¼ãƒ–ãƒ«ã«å«ã¾ã‚Œãªã„ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒæ¶ˆå¤±ã—ã¦ã—ã¾ã„ã¾ã™ã€‚`OUTER JOIN` ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§ãƒãƒƒãƒã™ã‚‹ãƒ‡ãƒ¼ã‚¿ãŒå­˜åœ¨ã—ãªã„å ´åˆã¯ `NULL` æ‰±ã„ã«ã—ã¦çµåˆã‚’è¡Œã†ã“ã¨ãŒã§ãã¾ã™ã€‚`LEFT OUTER JOIN` ã¨ `RIGHT OUTER JOIN` ã®2ç¨®é¡ãŒã‚ã‚Šã€ã©ã¡ã‚‰ã®ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ãƒ™ãƒ¼ã‚¹ã«å¤–éƒ¨çµåˆã™ã‚‹ã‹ã§ä½¿ã„åˆ†ã‘ã¾ã™ã€‚

In [9]:
%%sql
create temporary table tmp.some (
    id int,
    name text
)
;

create temporary table tmp.another (
    id int,
    attribute text
)
;

insert into tmp.some values (1, "alice"), (2, "bob"), (3, "carlie");
insert into tmp.another values (1, "hello"), (3, "world");

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.
0 rows affected.
3 rows affected.
2 rows affected.

[]

`tmp.some` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¯ `id` ã¨ `name` ãŒç´ã¥ã„ãŸãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå…¥ã£ã¦ã„ã¾ã™ã€‚

In [10]:
%%sql
select * from tmp.some;

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[(1, 'alice'), (2, 'bob'), (3, 'carlie')]

`tmp.another` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¯ `id` ã¨ `attribute` ãŒç´ã¥ã„ãŸãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå…¥ã£ã¦ã„ã¾ã™ã€‚

In [11]:
%%sql
select * from tmp.another;

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.

[(1, 'hello'), (3, 'world')]

`tmp.another` ã«ã¯ `id=2` ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå­˜åœ¨ã—ãªã„ã®ã§ã€`id` ã§ `INNER JOIN` ã™ã‚‹ã¨ `id=2` ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã¯çµåˆã•ã‚Œã¾ã›ã‚“ã€‚

In [12]:
%%sql
select
    *
from
    tmp.some
join
    tmp.another
using (id)

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.

[(1, 'alice', 'hello'), (3, 'carlie', 'world')]

`LEFT OUTER JOIN` ã®å ´åˆã¯ `tmp.some` ã«å…¥ã£ã¦ã„ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã¯å…¨ã¦æ®‹ã‚Šã€`tmp.another` ã«å¯¾å¿œã™ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒãªã„å ´åˆã¯ `NULL` ã§ã‚ã‚‹ã‚‚ã®ã¨ã—ã¦çµåˆã‚’è¡Œã„ã¾ã™ã€‚

In [13]:
%%sql
select
    *
from
    tmp.some
left outer join
    tmp.another
using (id)

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[(1, 'alice', 'hello'), (3, 'carlie', 'world'), (2, 'bob', None)]

`RIGHT OUTER JOIN` ã®å ´åˆã«ã¤ã„ã¦ã¯ `tmp.another` ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒãƒ™ãƒ¼ã‚¹ã«ãªã‚‹ã®ã§ `id=2` ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã¯çµåˆã•ã‚Œã¾ã›ã‚“ã€‚

In [14]:
%%sql
select
    *
from
    tmp.some
right outer join
    tmp.another
using (id)

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.

[(1, 'hello', 'alice'), (3, 'world', 'carlie')]

## 8. äº¤å·®çµåˆ

`CROSS JOIN` ã¯äºŒã¤ã®ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦å„ãƒ¬ã‚³ãƒ¼ãƒ‰ã®çµ„ã¿åˆã‚ã›ã‚’åˆ—æŒ™ã§ãã‚‹çµåˆæ–¹æ³•ã§ã™ã€‚

```sql
SELECT
    <å¼>
FROM
    <ãƒ†ãƒ¼ãƒ–ãƒ«>
CROSS JOIN
    <çµåˆã™ã‚‹ãƒ†ãƒ¼ãƒ–ãƒ«>
```

CROSS JOIN ã«ã¯ ON ãªã©ã®æ¡ä»¶æŒ‡å®šã¯ä»˜ãã¾ã›ã‚“ã€‚ä»¥ä¸‹ã¯ tmp.some ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ tmp.another ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ name ã¨ attribute ã®çµ„ã¿åˆã‚ã›ã‚’åˆ—æŒ™ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [15]:
%%sql
select
    name,
    attribute
from
    tmp.some
cross join
    tmp.another

 * mysql+pymysql://hello:***@10.0.1.100/employees
6 rows affected.

[('alice', 'hello'),
 ('alice', 'world'),
 ('bob', 'hello'),
 ('bob', 'world'),
 ('carlie', 'hello'),
 ('carlie', 'world')]

ã“ã‚Œã ã‘ã ã¨ä½•ãŒå¬‰ã—ã„ã®ã‹åˆ†ã‹ã‚Šã«ãã„ã§ã™ãŒã€æ—¥ä»˜ã«æŠœã‘ãŒã‚ã‚‹ã‚ˆã†ãªãƒ­ã‚°ãƒ‡ãƒ¼ã‚¿ã«å¯¾ã—ã¦ç©´åŸ‹ã‚ã‚’è¡Œãªã£ãŸã‚Šã€ãƒã‚¹ãƒˆã—ãŸæ§‹é€ ã«å¯¾å¿œã—ã¦ã„ã‚‹ã‚¯ã‚¨ãƒªã‚¨ãƒ³ã‚¸ãƒ³ï¼ˆPresto ã‚„ BigQuery ãªã©ï¼‰ã§ã¯é…åˆ—ãƒ‡ãƒ¼ã‚¿ã‚’ãƒ¬ã‚³ãƒ¼ãƒ‰ã«å¤‰æ›ã™ã‚‹ã¨ããªã©ã«ã‚ˆãä½¿ã„ã¾ã™ã€‚

ã“ã“ã§ã¯ MySQL 5.7 ã‹ã‚‰ã‚µãƒãƒ¼ãƒˆã•ã‚ŒãŸ `JSON` å‹ã‚’ä½¿ã£ã¦ `CROSS JOIN` ã§ JSON ã®é…åˆ—ã‚’ãƒ¬ã‚³ãƒ¼ãƒ‰ã«å¤‰æ›ã—ã¦ã¿ã¾ã—ã‚‡ã†ã€‚ã¾ãšã¯ JSON å‹ã®ã‚«ãƒ©ãƒ ã‚’æŒã¤ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œã£ã¦ã¿ã¾ã™ã€‚

In [16]:
%%sql
-- drop table tmp.hello_json;
create temporary table tmp.hello_json (
    data json
)
;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

ç¶šã‘ã¦ `data` ã‚«ãƒ©ãƒ ã« JSON ã®æ–‡å­—åˆ—ã‚’æ ¼ç´ã—ã¾ã™ã€‚

In [17]:
%%sql
insert into tmp.hello_json values ('{"hello":"world", "list": ["item-1", "item-2", "item-3"]}')

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[]

JSON ã®ãƒ—ãƒ­ãƒ‘ãƒ†ã‚£ã«ã‚¢ã‚¯ã‚»ã‚¹ã™ã‚‹ã«ã¯ `json_extract` é–¢æ•°ã‚’åˆ©ç”¨ã—ã¾ã™ã€‚

In [18]:
%%sql
select json_extract(data, '$.hello') from tmp.hello_json;

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[('"world"',)]

MySQL 8.0 ã§è¿½åŠ ã•ã‚ŒãŸ `json_table` é–¢æ•°ã‚’åˆ©ç”¨ã™ã‚‹ã¨ JSON æ–‡å­—åˆ—ã‚’ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ã—ã¦æ“ä½œã™ã‚‹ã“ã¨ãŒå¯èƒ½ã§ã™

In [19]:
%%sql
select
    *
from
    json_table('{"hello":"world"}', "$" columns (hello text path '$.hello')) as t

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[('world',)]

ã“ã‚Œã‚’ `CROSS JOIN` ã¨çµ„ã¿åˆã‚ã›ã‚‹ã“ã¨ã§ JSON ã®é…åˆ—ãƒ‡ãƒ¼ã‚¿ã‚’ãƒ¬ã‚³ãƒ¼ãƒ‰ã«åˆ†å‰²ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [20]:
%%sql
select
    item
from
    tmp.hello_json
cross join
    -- data ã¯ tmp.hello_json ã®ã‚«ãƒ©ãƒ 
    json_table(data, '$.list[*]' columns (item varchar(20) path '$')) as t

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[('item-1',), ('item-2',), ('item-3',)]

CROSS JOIN ã¯ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ã‚«ãƒ³ãƒåŒºåˆ‡ã‚Šã«ã™ã‚‹ã“ã¨ã§ã‚‚è¡¨ç¾ã§ãã¾ã™

In [21]:
%%sql
select
    item
from
    tmp.hello_json,
    json_table(data, '$.list[*]' columns (item varchar(20) path '$')) as t

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[('item-1',), ('item-2',), ('item-3',)]

## 9. UNION

`UNION` å¥ã‚’ä½¿ã†ã¨ã‚¯ã‚¨ãƒªã®çµæœã‚’ç¸¦æ–¹å‘ã«çµåˆã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [22]:
%%sql
select
    1 as id,
    'hello' as name

union
select
    2 as id,
    'world' as name

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.

[(1, 'hello'), (2, 'world')]

## ğŸŒ± ç·´ç¿’å•é¡Œ # 1/2

`dept_emp` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã®æƒ…å ±ã‚’å…ƒã«ã€æ‰€å±ã™ã‚‹ç¤¾å“¡ã®å¹³å‡çµ¦ä¸ï¼ˆsalaryï¼‰ãŒæœ€ã‚‚é«˜ã„éƒ¨ç½²ï¼ˆdepartmentï¼‰ã®éƒ¨ç½²åï¼ˆdept_nameï¼‰ã‚’èª¿æŸ»ã—ã¦ãã ã•ã„ã€‚`dept_emp` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã¯ãã‚Œãã‚Œ `to_date` ã‚«ãƒ©ãƒ ãŒ `9999-01-01` ã§ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æƒ…å ±ã‚’å¯¾è±¡ã¨ã™ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

Hint:

- `employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `dept_emp` ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ INNER JOIN ã—ç¤¾å“¡ãŒæ‰€å±ã™ã‚‹éƒ¨ç½² `dept_no` ã‚’ç´ä»˜ã‘ã¾ã™
- ä¸Šè¨˜çµæœã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ INNER JOIN ã—ç¤¾å“¡ã®çµ¦ä¸ `salary` ã‚’ç´ä»˜ã‘ã¾ã™
- éƒ¨ç½²ã”ã¨ã« `salary` ã‚«ãƒ©ãƒ  ã®å¹³å‡å€¤ã‚’æ±‚ã‚ã€å¹³å‡çµ¦ä¸ãŒæœ€å¤§ã® `dept_no` ã‚’æ±‚ã‚ã¾ã™
- ä¸Šè¨˜çµæœã«ã¤ã„ã¦ `departments` ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ INNER JOIN ã— `dept_name` ã‚’æ±‚ã‚ã¾ã™

In [66]:
%%sql
-- ã“ã“ã«ã‚¯ã‚¨ãƒªã‚’å…¥åŠ›ã—ã¦ãã ã•ã„
select 1

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[(1,)]

In [ ]:
# å®Ÿè¡Œå¾Œã€"your answer" ã®å³å´ã«è¡¨ç¤ºã•ã‚Œã‚‹å…¥åŠ›ãƒœãƒƒã‚¯ã‚¹ã«ç­”ãˆã‚’å…¥åŠ›ã— Enter ã‚­ãƒ¼ã‚’æŠ¼ã—ã¦ãã ã•ã„ m(_ _)m
import urllib.request

answer = input('your answer (dept_name): ')

url = 'http://10.0.1.100:18080/submit'
data = 'q=q401&a={}'.format(answer.strip()).encode('utf-8')
req = urllib.request.Request(url, data=data, method='POST')
with urllib.request.urlopen(req) as res:
    print(res.read().decode('utf-8'))

## ğŸŒ± ç·´ç¿’å•é¡Œ # 2/2

å…ˆã»ã©è¨˜è¿°ã—ãŸã‚¯ã‚¨ãƒªã¨ `titles` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã®æƒ…å ±ã‚’å…ƒã«ã€æ‰€å±ã™ã‚‹ç¤¾å“¡ã®å¹³å‡çµ¦ä¸ãŒæœ€å¤§ã§ã‚ã‚‹éƒ¨ç½²ã®ä¸­ã§ `title` ãŒ `Staff` ã®ç¤¾å“¡ã®ã†ã¡çµ¦ä¸ `salary` ãŒæœ€ã‚‚é«˜ã„ç¤¾å“¡ã® `first_name` ã‚’èª¿ã¹ã¦ãã ã•ã„ã€‚ãŸã ã— `titles` ãƒ†ãƒ¼ãƒ–ãƒ«ã¨ `salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã¯ `to_date` ã‚«ãƒ©ãƒ ãŒ `9999-01-01` ã§ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æƒ…å ±ã‚’å¯¾è±¡ã¨ã™ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

In [65]:
%%sql
-- ã“ã“ã«ã‚¯ã‚¨ãƒªã‚’å…¥åŠ›ã—ã¦ãã ã•ã„
select 1

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[(1,)]

In [ ]:
# å®Ÿè¡Œå¾Œã€"your answer" ã®å³å´ã«è¡¨ç¤ºã•ã‚Œã‚‹å…¥åŠ›ãƒœãƒƒã‚¯ã‚¹ã«ç­”ãˆã‚’å…¥åŠ›ã— Enter ã‚­ãƒ¼ã‚’æŠ¼ã—ã¦ãã ã•ã„ m(_ _)m
import urllib.request

answer = input('your answer (first_name): ')

url = 'http://10.0.1.100:18080/submit'
data = 'q=q402&a={}'.format(answer.strip()).encode('utf-8')
req = urllib.request.Request(url, data=data, method='POST')
with urllib.request.urlopen(req) as res:
    print(res.read().decode('utf-8'))